In [4]:
import pandas as pd
import numpy as np

In [202]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [203]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are 
meant to increase by 10 with each row so 10055 and 10075 need to be put in 
place. Fill in these missing numbers and make the column an integer column 
(instead of a float column).

In [122]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [204]:
df['FlightNumber']=df['FlightNumber'].astype('Int64')

In [205]:
for i in range(1, df['FlightNumber'].count() + 1):
      if pd.isnull(df.loc[i,'FlightNumber']):
          df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber'] + 10

In [206]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each 
string on the underscore delimiter _ to give a new temporary DataFrame with 
the correct values. Assign the correct column names to this temporary 
DataFrame.

In [228]:
lst1=[]
lst2=[]
for i in range(len(df['From_To'])):
   a,b=(df['From_To'][i]).split(sep='_')
   lst1.append(a)
   lst2.append(b)

In [243]:
temp=pd.DataFrame({'From':lst1,'To':lst2})

In [244]:
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

Notice how the capitalisation of the city names is all mixed up in this 
temporary DataFrame. Standardise the strings so that only the first letter is 
uppercase (e.g. "londON" should become "London".)

In [247]:
for i in range(len(temp)):
    temp['From'][i]=temp['From'][i].capitalize()
    temp['To'][i]=temp['To'][i].capitalize()

In [248]:
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame 
from the previous questions.

In [252]:
df.drop('From_To',axis=1,inplace=True)

In [257]:
df[["From","To"]]=temp[["From","To"]]

In [258]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the 
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value 
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns 
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df 
with delays.

In [550]:
for i in range(len(df['RecentDelays'])):
    c=3
    c=c-len(a[i])
    a[i]=np.pad(a[i], (c, 0), 'constant', constant_values=(0))

In [551]:
d=list(a)

In [552]:
s=pd.DataFrame(d,columns=['Delay_1','Delay_2','Delay_3'])

In [561]:
s.replace(0.0,np.NaN)

   Delay_1  Delay_2  Delay_3
0      NaN     23.0     47.0
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3      NaN      NaN     13.0
4      NaN     67.0     32.0

In [562]:
df.drop('RecentDelays',axis=1,inplace=True)

KeyError: "['RecentDelays'] not found in axis"

In [563]:
df['Delays_1']=s['Delay_1']
df['Delays_2']=s['Delay_2']
df['Delays_3']=s['Delay_3']

In [567]:
df.replace(0.0,np.NaN,inplace=True)

In [568]:
df

,FlightNumber,Airline,From,To,Delays_1,Delays_2,Delays_3
0,10045,KLM(!),London,Paris,NaN,23.0,47.0
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,NaN,NaN,13.0
4,10085,"""Swiss Air""",Brussels,London,NaN,67.0,32.0